benchmark_results_replicated/20260803_085536/analysis/rep6/run/go_mock_c25/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-mock
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   583.96us  351.20us   4.95ms   65.34%
    Req/Sec    10.39k   201.20    11.10k    69.43%
  Latency Distribution
     50%  543.00us
     75%  811.00us
     90%    1.08ms
     99%    1.46ms
  2484591 requests in 1.00m, 303.29MB read
Requests/sec:  41340.92
Transfer/sec:      5.05MB
P95: 1217
P99: 1460